# St7GetNumEntitySets

Returns the number of entity sets.

long St7GetNumEntitySets(long uID, long* NumSets)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

NumSets

The number of entity sets.